WalletSystem/app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("amount", "source_wallet_id", "target_wallet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 100.0], ["source_wallet_id", 1], ["target_wallet_id", 2], ["created_at", "2024-11-01 07:11:32.837277"], ["updated_at", "2024-11-01 07:11:32.837277"]]
---
  def create
    ActiveRecord::Base.transaction do
      transaction = Transaction.create!(transaction_params)