WalletSystem/app/controllers/wallets_controller.rb

  def show_balance
    wallet = Wallet.find(params[:id])
---
SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]